<script>
export default {
  name: "AppPolitics",
  components: {},
  data() {
    return {};
  },
  methods: {},
  mounted() {},
};
</script>

<template>
  <div class="privacy-policy">
    <h1>Политика конфиденциальности</h1>

    <section class="policy-section">
      <h2>Общие положения</h2>
      <p>
        Настоящая Политика конфиденциальности регулирует порядок сбора,
        обработки и использования персональных данных пользователей сайта.
      </p>
    </section>

    <section class="policy-section">
      <h2>Собирание и использование персональной информации</h2>
      <ul>
        <li>
          <strong>1. Сбор данных:</strong> Сайт собирает только те данные,
          которые необходимы для предоставления услуг и улучшения качества
          работы сайта.
        </li>
        <li>
          <strong>2. Типы собранных данных:</strong> Мы можем собирать следующую
          информацию:
          <ul>
            <li>Имя и контактные данные пользователя</li>
            <li>Информация о браузере и устройстве</li>
            <li>Данные о поведении пользователя на сайте</li>
          </ul>
        </li>
        <li>
          <strong>3. Использование данных:</strong> Мы используем эту информацию
          для:
          <ul>
            <li>Предоставления услуг по миграции и декларации</li>
            <li>Улучшения качества работы сайта</li>
            <li>Анализа трафика и оптимизации контента</li>
            <li>Отправки уведомлений и рассылок</li>
          </ul>
        </li>
      </ul>
    </section>

    <section class="policy-section">
      <h2>Безопасность данных</h2>
      <p>
        Мы принимаем все необходимые меры для защиты персональных данных от
        несанкционированного доступа, изменения или разглашения.
      </p>
      <p>
        Все передаваемые через интернет данные шифруются и защищены протоколом
        HTTPS.
      </p>
    </section>

    <section class="policy-section">
      <h2>Использование cookie-файлов</h2>
      <p>
        Сайт использует cookie-файлы для сохранения информации о предпочтениях
        пользователя и улучшения навигации по сайту.
      </p>
      <p>
        Пользователь может отказаться от использования cookie-файлов в
        настройках своего браузера.
      </p>
    </section>

    <section class="policy-section">
      <h2>Передача данных третьим лицам</h2>
      <p>
        Мы не передаем ваши персональные данные третьим лицам без вашего
        согласия, кроме случаев, предусмотренных законодательством.
      </p>
      <p>
        В случае необходимости передачи данных, мы обеспечиваем безопасность
        передаваемой информации.
      </p>
    </section>

    <section class="policy-section">
      <h2>Права пользователя</h2>
      <p>
        Вы можете получить доступ к своим персональным данным, исправить их или
        удалить при необходимости.
      </p>
      <p>
        Для этого обратитесь к администратору сайта по адресу
        [admin@migration-declaration.com].
      </p>
    </section>

    <section class="policy-section">
      <h2>Изменение политики</h2>
      <p>
        Мы можем вносить изменения в настоящую Политику. Обновленную версию мы
        публикуем на сайте.
      </p>
    </section>

    <section class="policy-section">
      <h2>Контакты</h2>
      <p>
        Если у вас есть вопросы или пожелания по поводу нашей Политики
        конфиденциальности, пожалуйста, обращайтесь к нам по адресу
        [info@migration-declaration.com].
      </p>
    </section>

    <section class="policy-section">
      <h2>Заключение</h2>
      <p>
        Мы ценим ваше доверие и стремимся обеспечить безопасность ваших личных
        данных. Если у вас возникнут дополнительные вопросы, пожалуйста,
        свяжитесь с нами.
      </p>
    </section>

    <footer>
      <i>Действительна с даты 15.09.2024</i>
    </footer>
  </div>
</template>

<style scoped>
.privacy-policy {
  max-width: 800px;
  margin: 0 auto;
  padding: 20px;
  padding-top: 80px;
}

.policy-section {
  border-bottom: 1px solid #ccc;
  padding-bottom: 20px;
  margin-bottom: 20px;
}

h1,
h2 {
  color: #333;
}

h1 {
  font-size: 30px;
  font-weight: 400;
  text-align: center;
}
h2 {
  font-size: 22px;
  font-weight: 400;
  margin-bottom: 10px;
}

ul {
  list-style-type: none;
  padding-left: 20px;
}

li {
  margin-bottom: 10px;
}

footer {
  text-align: center;
  margin-top: 40px;
}
</style>
